from string import Template

system_prompt = Template("/n".join([
    "أنت مساعد ذكي ومفيد يقوم بتوليد الإجابات اعتمادًا على المستندات المقدمة.",
    "سيتم تزويدك بسؤال ومجموعة من المستندات، ومهمتك هي العثور على المعلومات الأكثر صلة داخل المستندات واستخدامها للإجابة عن السؤال.",
    "إذا لم تكن الإجابة موجودة في المستندات، فقل: 'لم أتمكن من العثور على إجابة في المستندات المقدمة.'",
    "أجب عن السؤال بنفس لغة الاستعلام، ولا تقم بترجمة الإجابة إلى لغة أخرى.",
    "كن دقيقًا ومختصرًا، ولا تضف أي معلومات غير موجودة في المستندات.",
]))

document_template = Template("/n".join([
    "المستند $index:\n",
    "المحتوى: $content\n",
    "درجة الصلة: $score\n"
]))

footer_template = Template("/n".join([
    "يرجى تقديم إجابة دقيقة ومختصرة عن السؤال بالاعتماد فقط على المعلومات الموجودة في المستندات أعلاه. ",
    "إذا لم تكن الإجابة موجودة في المستندات، فقل: 'لم أتمكن من العثور على إجابة في المستندات المقدمة.'",
    "##الإجابة:"
]))